# Business KPI Analysis Using SQL

**Objective:**  
Use SQL to compute key business metrics related to sales performance, seasonality, and risk. These queries replicate questions a business stakeholder or manager might ask when making operational decisions.

## Questions:

Q1. WHat are total and average weekly sales?

Q2. Which stores contribute the most and least to total revenue?

Q3. How do Holiday and Non-Holiday sales compare?

Q4. Which stores are the most volatile?

Q5. How does volatility differ during the holidays?

In [2]:
#import libraries
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('..\db\walmart.db')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\david\AppData\Local\Temp\ipykernel_3524\3339318204.py:1: SyntaxWarning: invalid escape sequence '\d'
  conn = sqlite3.connect('..\db\walmart.db')

In [4]:
pd.read_sql(
    "SELECT name FROM sqlite_master WHERE type ='table';",
    conn
)

            name
0  walmart_sales

In [5]:
pd.read_sql(
    "SELECT * FROM walmart_sales LIMIT 5",
    conn
)

,Store,Dept,Date,Weekly_Sales,IsHoliday,Type,Size,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment
0,1,1,2010-02-05 00:00:00,24924.50,0,A,151315,42.31,2.572,None,None,None,None,None,211.096358,8.106
1,1,1,2010-02-12 00:00:00,46039.49,1,A,151315,38.51,2.548,None,None,None,None,None,211.242170,8.106
2,1,1,2010-02-19 00:00:00,41595.55,0,A,151315,39.93,2.514,None,None,None,None,None,211.289143,8.106
3,1,1,2010-02-26 00:00:00,19403.54,0,A,151315,46.63,2.561,None,None,None,None,None,211.319643,8.106
4,1,1,2010-03-05 00:00:00,21827.90,0,A,151315,46.50,2.625,None,None,None,None,None,211.350143,8.106

## Overall Sales Performance (Baseline KPIs)

In [19]:
pd.read_sql("""
SELECT ROUND(SUM(Weekly_Sales)/1000000000,4) as Total_Sales_Ten_Billions,
        Round(AVG(Weekly_Sales),2) as Average_Waekly_Sales
from walmart_sales
""",
conn
)

   Total_Sales_Ten_Billions  Average_Waekly_Sales
0                    6.7372              15981.26

## Time Series Analysis — Sales Trends

In [25]:
pd.read_sql("""
SELECT Date,
        ROUND(AVG(Weekly_Sales), 2) as Average_Weekly_Sales
From walmart_sales
GROUP BY Date
ORDER BY Date
""",
conn
)

                    Date  Average_Weekly_Sales
0    2010-02-05 00:00:00              16836.12
1    2010-02-12 00:00:00              16352.06
2    2010-02-19 00:00:00              16216.66
3    2010-02-26 00:00:00              14899.55
4    2010-03-05 00:00:00              15921.02
..                   ...                   ...
138  2012-09-28 00:00:00              14765.33
139  2012-10-05 00:00:00              15983.41
140  2012-10-12 00:00:00              15427.60
141  2012-10-19 00:00:00              15295.73
142  2012-10-26 00:00:00              15391.73

[143 rows x 2 columns]

In [27]:
pd.read_sql("""
SELECT Date,
        Round(SUM(Weekly_Sales),2) as Total_Weekly_Sales
from walmart_sales
GROUP BY Date
ORDER BY Date
""",
conn)

                    Date  Total_Weekly_Sales
0    2010-02-05 00:00:00         49750740.50
1    2010-02-12 00:00:00         48336677.63
2    2010-02-19 00:00:00         48276993.78
3    2010-02-26 00:00:00         43968571.13
4    2010-03-05 00:00:00         46871470.30
..                   ...                 ...
138  2012-09-28 00:00:00         43734899.40
139  2012-10-05 00:00:00         47566639.31
140  2012-10-12 00:00:00         46128514.25
141  2012-10-19 00:00:00         45122410.57
142  2012-10-26 00:00:00         45544116.29

[143 rows x 2 columns]